app/Controllers/Barang.php

    public function index()
    {
        $db = \Config\Database::connect();

        // Ambil daftar kategori unik untuk dropdown filter di view barang
        $listKategori = $db->table('barang')
            ->select('kategori')
            ->where('kategori !=', '')
            ->groupBy('kategori')
            ->get()
            ->getResultArray();
---
SELECT `kategori`
FROM `barang`
WHERE `kategori` != ''
GROUP BY `kategori`

            'listKategori'  => $listKategori,
            'kategoriAktif' => $kategoriSelected,
            // Mengambil semua barang dan diurutkan berdasarkan Views terbanyak (populer)
            'barang'        => $this->barangModel->orderBy('views', 'DESC')->findAll()
---
SELECT *
FROM `barang`
ORDER BY `views` DESC

    public function detail($id)
    {
        // Ambil data barang terlebih dahulu
        $barang = $this->barangModel->find($id);

        // Jika data barang tidak ditemukan
        if (!$barang) {
            throw \CodeIgniter\Exceptions\PageNotFoundException::forPageNotFound();
        }

        // --- LOGIKA UPDATE VIEW (MODIFIKASI) ---
        // Cek role user dari session. Views hanya bertambah jika yang login BUKAN admin.
        if (strtolower(session()->get('role')) !== 'admin') {
            $this->barangModel->where('id_barang', $id)
                ->set('views', 'views + 1', FALSE)
                ->update();
---
SELECT *
FROM `barang`
WHERE `barang`.`id_barang` = '1'
UPDATE `barang` SET `views` = views + 1, `updated_at` = '2026-04-20 17:45:24'
WHERE `id_barang` = '1'