app/Controllers/BaseController.php

SELECT `transaksi`.*, `users`.`nama` as `nama_user`
FROM `transaksi`
JOIN `users` ON `users`.`id_user` = `transaksi`.`id_user`
WHERE `is_read` = 0
ORDER BY `transaksi`.`created_at` DESC
---
    public function initController(RequestInterface $request, ResponseInterface $response, LoggerInterface $logger)
    {
        // Do Not Edit This Line
        parent::initController($request, $response, $logger);

        // Preload any models, libraries, etc, here.
        $this->session = \Config\Services::session();
        $this->db      = \Config\Database::connect();

        // Ambil data session yang dibutuhkan
        $id_user = $this->session->get('id_user');
        $role    = $this->session->get('role'); // Ambil role untuk filter notifikasi

        // Inisialisasi variabel default agar view tidak error
        $notif_count = 0;
        $notif_list  = [];

        // --- 1. LOGIKA NOTIFIKASI KHUSUS ADMIN (Pesanan Baru) ---
        // Jika yang login adalah admin, ambil data transaksi yang belum dibaca (is_read = 0)
        if ($role == 'admin' || $role == 'Admin') {
            $builder = $this->db->table('transaksi');
            $builder->select('transaksi.*, users.nama as nama_user');
            $builder->join('users', 'users.id_user = transaksi.id_user');
            $builder->where('is_read', 0); // Hanya yang belum dibaca admin
            $builder->orderBy('transaksi.created_at', 'DESC');

            $notif_list  = $builder->get()->getResultArray();

SELECT COUNT(*) AS `numrows`
FROM `transaksi`
WHERE `id_user` = '2'
AND `denda` > 0
AND `status_denda` = 0
---
        // --- 2. LOGIKA NOTIFIKASI KHUSUS USER (Denda) ---
        // Jika yang login adalah user biasa, ambil jumlah transaksi yang ada dendanya
        elseif ($id_user) {
            $notif_count = $this->db->table('transaksi')
                ->where('id_user', $id_user)
                ->where('denda >', 0) // Filter transaksi yang memiliki denda
                ->where('status_denda', 0) // <--- TAMBAHAN: Hanya hitung denda yang BELUM LUNAS
                ->countAllResults();