app/Controllers/Chat.php

    public function tanyaAi()
    {
        $pesanUser = $this->request->getPost('pesan');
        $apiKey = getenv('GEMINI_API_KEY') ?: env('GEMINI_API_KEY');

        // 1. Ambil Session User
        $session = session();
        $userRole = $session->get('role');
        $namaLogin = $session->get('nama') ?? 'Tamu';

        $db = \Config\Database::connect();

        // 2. Data Umum
        $dataBarang = $db->table('barang')->select('nama_barang, kategori, stok, harga_sewa, kondisi')->get()->getResultArray();
        $dataGunung = $db->table('gunung')->select('nama_gunung, lokasi, ketinggian, status, foto, deskripsi')->get()->getResultArray();

        // 3. Filter Ketat
        $konteksRahasia = "";
        if ($userRole === 'admin') {
            $dataTransaksi = $db->table('transaksi')->select('id_user, id_barang, tgl_pinjam, tgl_kembali, total_harga, denda, status_denda, status_transaksi, is_read, bukti_bayar')->get()->getResultArray();

            $dataUser = $db->table('users')->select('nama, role, username')->get()->getResultArray();
---
SELECT `nama_barang`, `kategori`, `stok`, `harga_sewa`, `kondisi`
FROM `barang`
SELECT `nama_gunung`, `lokasi`, `ketinggian`, `status`, `foto`, `deskripsi`
FROM `gunung`
SELECT `id_user`, `id_barang`, `tgl_pinjam`, `tgl_kembali`, `total_harga`, `denda`, `status_denda`, `status_transaksi`, `is_read`, `bukti_bayar`
FROM `transaksi`
SELECT `nama`, `role`, `username`
FROM `users`