app/Controllers/Home.php

SELECT SUM(`denda`) AS `denda`
FROM `transaksi`
WHERE `id_user` = '1'
AND `status_denda` = 0
SELECT COUNT(*) AS `numrows`
FROM `transaksi`
WHERE `is_read` = 0
---
    public function index()
    {
        // 1. Koneksi ke Database menggunakan Query Builder
        $db = \Config\Database::connect();

        // 2. Mengambil ID User dan Role dari Session
        $id_user   = session()->get('id_user');
        $username = session()->get('username');
        $role     = session()->get('role');

        /**
         * 3. LOGIKA NOTIFIKASI USER: Menghitung total nominal denda.
         */
        $total_denda = $db->table('transaksi')
            ->selectSum('denda')
            ->where('id_user', $id_user)
            ->where('status_denda', 0)
            ->get()->getRow()->denda;

        /**
         * 3.1 LOGIKA NOTIFIKASI ADMIN: Menghitung pesanan baru.
         */
        $pesanan_baru_count = 0;
        if ($role == 'admin' || $role == 'Admin') {
            $pesanan_baru_count = $db->table('transaksi')
                ->where('is_read', 0)
                ->countAllResults();

SELECT `kategori`, COUNT(*) as total, MAX(foto_barang) as foto_barang
FROM `barang`
GROUP BY `kategori`
---
        /**
         * 4. LOGIKA OTOMATIS: Mengambil rincian per kategori.
         */
        $rincianKategori = $db->table('barang')
            ->select('kategori, COUNT(*) as total, MAX(foto_barang) as foto_barang')
            ->groupBy('kategori')
            ->get()
            ->getResultArray();

SELECT MONTH(tgl_pinjam) as bulan, SUM(total_harga + IF(status_denda = 1, `denda`, 0)) as total
FROM `transaksi`
WHERE YEAR(tgl_pinjam) = '2026'
AND `status_transaksi` = 'Selesai'
GROUP BY MONTH(tgl_pinjam)
---
        /**
         * 5. LOGIKA GRAFIK PENDAPATAN TAHUNAN (Line Chart):
         */
        $dataPendapatan = $db->table('transaksi')
            ->select('MONTH(tgl_pinjam) as bulan, SUM(total_harga + IF(status_denda = 1, denda, 0)) as total')
            ->where('YEAR(tgl_pinjam)', date('Y'))
            ->where('status_transaksi', 'Selesai')
            ->groupBy('MONTH(tgl_pinjam)')
            ->get()->getResultArray();

SELECT MONTH(tgl_pinjam) as bulan, SUM(total_harga + IF(status_denda = 1, `denda`, 0)) as total
FROM `transaksi`
WHERE YEAR(tgl_pinjam) = '2026'
AND `status_transaksi` = 'Selesai'
GROUP BY MONTH(tgl_pinjam)
SELECT SUM(total_harga) as harga, SUM(IF(status_denda = 1, `denda`, 0)) as total_denda_lunas
FROM `transaksi`
WHERE `status_transaksi` = 'Selesai'
---
        /**
         * 5.1 LOGIKA TOTAL PENDAPATAN KESELURUHAN:
         */
        $resPendapatan = $db->table('transaksi')
            ->select('SUM(total_harga) as harga, SUM(IF(status_denda = 1, denda, 0)) as total_denda_lunas')
            ->where('status_transaksi', 'Selesai')
            ->get()->getRow();

SELECT `barang`.`kategori`, SUM(transaksi.total_harga + IF(transaksi.status_denda = 1, `transaksi`.`denda`, 0)) as total
FROM `transaksi`
JOIN `barang` ON `barang`.`id_barang` = `transaksi`.`id_barang`
WHERE MONTH(transaksi.tgl_pinjam) = '04'
AND YEAR(transaksi.tgl_pinjam) = '2026'
AND `transaksi`.`status_transaksi` = 'Selesai'
GROUP BY `barang`.`kategori`
---
         * --- LOGIKA BARU: GRAFIK PIE (LINGKARAN) PENDAPATAN BULAN INI ---
         * Catatan: Jika data bulan ini kosong, grafik akan mengirimkan [0] agar tidak error.
         */
        $pendapatanPie = $db->table('transaksi')
            ->select('barang.kategori, SUM(transaksi.total_harga + IF(transaksi.status_denda = 1, transaksi.denda, 0)) as total')
            ->join('barang', 'barang.id_barang = transaksi.id_barang')
            ->where('MONTH(transaksi.tgl_pinjam)', date('m'))
            ->where('YEAR(transaksi.tgl_pinjam)', date('Y'))
            ->where('transaksi.status_transaksi', 'Selesai')
            ->groupBy('barang.kategori')
            ->get()->getResultArray();

SELECT *
FROM `barang`
ORDER BY `views` DESC
 LIMIT 4
SELECT `transaksi`.*, `barang`.`nama_barang`
FROM `transaksi`
JOIN `barang` ON `barang`.`id_barang` = `transaksi`.`id_barang`
WHERE `transaksi`.`id_user` = '2'
AND `transaksi`.`status_transaksi` = 'Dipinjam'
---
        /**
         * --- LOGIKA VIEW TRACKER & TRANSAKSI AKTIF ---
         */
        $rekomendasiBarang = $db->table('barang')
            ->orderBy('views', 'DESC')
            ->limit(4)
            ->get()->getResultArray();

        $transaksiAktif = [];
        if ($role == 'user' || $role == 'User') {
            $transaksiAktif = $db->table('transaksi')
                ->select('transaksi.*, barang.nama_barang')
                ->join('barang', 'barang.id_barang = transaksi.id_barang')
                ->where('transaksi.id_user', $id_user)
                ->where('transaksi.status_transaksi', 'Dipinjam')
                ->get()->getResultArray();

SELECT COUNT(*) AS `numrows` FROM `barang`
SELECT COUNT(*) AS `numrows` FROM `users`
---
        /**
         * 6. Menyiapkan data untuk dikirim ke View Dashboard.
         */
        $data = [
            'title'              => 'Dashboard Utama',
            'totalBarang'        => $db->table('barang')->countAll(),
            'totalUser'          => $db->table('users')->countAll(),
            'rincianKategori'    => $rincianKategori,
            'total_denda'        => $total_denda ?? 0,
            'pesanan_baru'       => $pesanan_baru_count,
            'pendapatan_bulanan' => json_encode($grafik),
            'totalPendapatan'    => $totalSeluruhPendapatan,
            'rekomendasi_barang' => $rekomendasiBarang,
            'transaksi_aktif'    => $transaksiAktif,
            'label_pie'          => json_encode($label_pie),
            'data_pie'           => json_encode($data_pie),
        ];

SELECT COUNT(*) AS `numrows` FROM `barang`
SELECT SUM(`stok`) AS `stok`
FROM `barang`
---
         * 7. Mengambil info stok dari Model Barang.
         */
        $modelBarang = new \App\Models\BarangModel();
        $data['totalBarang'] = $modelBarang->countAll();
        $data['totalStok']   = $modelBarang->selectSum('stok')->get()->getRow()->stok;