app/Controllers/Transaksi.php

SELECT `transaksi`.*, `barang`.`nama_barang`, `users`.`nama` as `nama_user`, `users`.`no_wa`
FROM `transaksi`
JOIN `barang` ON `barang`.`id_barang` = `transaksi`.`id_barang`
JOIN `users` ON `users`.`id_user` = `transaksi`.`id_user`
ORDER BY `transaksi`.`created_at` DESC
---
    public function kelola()
    {
        $keyword = $this->request->getVar('cari');
        $tgl_filter = $this->request->getVar('tgl'); // Ambil input filter tanggal

        $query = $this->transaksiModel->select('transaksi.*, barang.nama_barang, users.nama as nama_user, users.no_wa')
            ->join('barang', 'barang.id_barang = transaksi.id_barang')
            ->join('users', 'users.id_user = transaksi.id_user');

        // Filter berdasarkan tanggal jika admin memilih tanggal tertentu
        if ($tgl_filter) {
            $query->where('transaksi.tgl_pinjam', $tgl_filter);
        }

        if ($keyword) {
            $query->groupStart()
                ->like('barang.nama_barang', $keyword)
                ->orLike('users.nama', $keyword)
                ->orLike('transaksi.status_transaksi', $keyword)
                ->groupEnd();
        }

        $data = [
            'title'     => 'Kelola Transaksi - Admin',
            'transaksi' => $query->orderBy('transaksi.created_at', 'DESC')->findAll(),