app/Controllers/Users.php

SELECT *
FROM `users`
---
    public function index()
    {
        // ---
        if (session()->get('role') != 'admin') {
            return redirect()->to('/dashboard')->with('error', 'Akses ditolak! Anda bukan Admin.');
        }
        // ------------------------------

        // TAMBAHAN FITUR CARI
        $cari = $this->request->getVar('cari');
        if ($cari) {
            $this->users->groupStart()
                ->like('nama', $cari)
                ->orLike('username', $cari)
                ->orLike('no_wa', $cari)
                ->groupEnd();
        }

        $data['users'] = $this->users->findAll();