app/Controllers/Wishlist.php

SELECT `barang`.*
FROM `wishlist`
JOIN `barang` ON `barang`.`id_barang` = `wishlist`.`id_barang`
WHERE `wishlist`.`id_user` = '2'
---
    public function index()
    {
        $id_user = session()->get('id_user');

        // Proteksi: Jika belum login, tendang ke halaman login
        if (!$id_user) {
            return redirect()->to('/login')->with('error', 'Silakan login terlebih dahulu.');
        }

        $db = \Config\Database::connect();

        // Ambil data barang dengan cara JOIN tabel wishlist dan tabel barang
        $data['barang'] = $db->table('wishlist')
            ->select('barang.*')
            ->join('barang', 'barang.id_barang = wishlist.id_barang')
            ->where('wishlist.id_user', $id_user)
            ->get()->getResultArray();