app/Views/layouts/dashboard.php

SELECT COUNT(*) AS `numrows`
FROM `transaksi`
WHERE `status_transaksi` = 'Dipinjam'
---
                                <p class="text-warning text-uppercase fw-bold mb-1 fs-12 tracking-wider">Barang Dipinjam</p>
                                <?php
                                $db = \Config\Database::connect();
                                $totalDipinjam = $db->table('transaksi')->where('status_transaksi', 'Dipinjam')->countAllResults();